<template>
        <div class="privacy" >
            <div class="privacy-content">
                <div class="privacy-top">
                    服协议和隐私政策
                </div>          
                <div class="content"> 
                    一、您个人信息的收集
我们收集信息是为了向您提供更好以及更个性化的服务，并努力提高您的用户体验。我们收集信息的种类如下：
1、您向我们提供的信息
当您注册前端账户及您在使用相关前端服务时填写、提交及/或其他任何方式提供的信息，包括您的姓名、性别、出生年月日、身份证号码、电话号码、电子邮箱、收货地址、银行卡信息及相关附加信息（如您地址中的所在的省份和城市、邮政编码等）。您可以选择不提供某一或某些信息，但是这样可能使您无法使用前端的许多特色服务。请您理解，我们使用您提供的信息是为了回应您的要求，为您在前端购物或享受服务提供便利，完善前端网站以及与您进行信息沟通。
2、我们在您使用服务过程中获得的信息
为了提高服务质量和用户体验，我们会留存您使用服务以及使用方式的相关信息，这类信息包括：
（1）您的浏览器和计算机上的信息。在您访问前端网站或使用前端服务时，前端系统自动接收并记录的您的浏览器和计算机上的信息（包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据）。
（2）您的位置信息。当您下载或使用前端、其关联方及合作伙伴开发的应用程序，或访问移动网页使用前端服务时，前端可能会读取您的位置（大多数移动设备将允许您关闭定位服务，具体建议您联系您的移动设备的服务商或生产商）。
（3）您的设备信息。前端可能会读取您访问前端或使用前端服务时所使用的终端设备的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。
（4）您的行为或交易信息。前端可能会记录您访问前端或使用前端服务时所进行的操作以及您在前端网站上进行交易的相关信息。
除上述信息外，我们还可能为了提供服务及改进服务质量的合理需要而获得的您的其他信息，包括您与我们的客服团队联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息，以及您与前端的关联方、前端合作伙伴之间互动时我们获得的相关信息。
同时，为提高您使用前端提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，我们可能会通过了解一些您的网络使用习惯、您常用的软件信息等手段来判断您账户的风险，并可能会记录一些我们认为有风险的链接（“URL”）。
3、来自第三方的信息
指在您注册前端账户和使用服务过程中，您授权前端可向前端的关联方、合作伙伴获取其所收集的相关信息。这些信息包括但不限于您的身份信息、行为信息、交易信息、设备信息等，前端会将此类信息汇总，用于帮助前端向您提供更好以及更加个性化的服务或更好的预防互联网欺诈。
您了解并同意，以下信息不适用本隐私政策：
（1）您在使用前端提供的搜索服务时输入的关键字信息；
（2）信用评价、违反法律法规规定或违反前端平台规则行为及前端已对您采取的措施；
（3）应法律法规要求需公示的企业名称等相关工商注册信息以及自然人经营者的信息。
（4）其他您与前端或前端的关联方所签署的协议（包括在线签署的电子协议，例如《前端用户注册协议》）以及前端平台规则中明确约定或提示您不适用本隐私政策的与您有关的信息。
二、我们对您个人信息的管理和使用

为向您提供服务、提升我们的服务质量以及优化您的服务体验，我们会在符合法律规定下使用您的个人信息，并主要用于下列用途：
1、向您提供您使用的各项服务，并维护、改进这些服务。
2、向您推荐您可能感兴趣的内容，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或在征得您同意的情况下与前端的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息。如您不希望接收上述信息，可通过相应的退订功能进行退订。
3、我们可能使用您的个人信息以验证身份、预防、发现、调查欺诈、危害安全、非法或违反与我们或其关联方协议、政策或规则的行为，以保护您、其他前端用户，或我们或其关联方的合法权益。
4、我们可能会将来自某项服务的个人信息与来自其他服务所获得的信息结合起来，用于为了给您提供更加个性化的服务使用，例如为让您通过购物拥有更广泛的社交圈而使用、共享或披露您的信息。
5、我们会对我们的服务使用情况进行统计，并可能会与公众或第三方分享这些统计信息，以展示我们的产品或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。
6、让您参与有关我们产品及服务的调查。
7、经您同意或授权的其他用途。

三、您个人信息的分享

您的个人信息是我们为您提供服务的重要部分，我们会遵循法律规定对您的信息承担保密义务。除以下情形外，我们不会将您的个人信息披露给第三方：
1、征得您的同意或授权。
2、根据法律法规的规定或行政或司法机构的要求。
3、出于实现“我们对您个人信息的管理和使用”部分所述目的，或为履行我们在《前端用户注册协议》或本隐私政策中的义务和行使我们的权利，向前端的关联方、合作伙伴或代表前端履行某项职能的第三方（例如代表我们发出推送通知的通讯服务商、处理银行卡的支付机构等）分享您的个人信息。
4、如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能产生的权利纠纷。
5、只有共享您的信息，才能提供您需要的服务，或处理您与他人的纠纷或争议。
6、您出现违反中国有关法律、法规规定或者违反您与前端签署的相关协议（包括在线签署的电子协议）或违反相关前端平台规则时需要向第三方披露的情形。
7、为维护前端及其关联方或其他前端用户的合法权益。
随着我们业务的发展，我们及我们的关联方有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移。我们将在转移前通知您。

四、您个人信息的安全

前端严格保护您的个人信息安全。我们使用各种制度、安全技术和程序等措施来保护您的个人信息不被未经授权的访问、篡改、披露或破坏。如果您对我们的个人信息保护有任何疑问，请联系我们的客服。
在通过前端网站与第三方进行网上商品或服务的交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址等。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是你的账户及密码发生泄露，请您立即联络我们的客服，以便我们采取相应措施。

五、访问和更新您的个人信息

您可以在“个人中心”页面的“我的账户”菜单中查阅您提交给前端的所有个人信息，你也可通过上述途径更新除实名认证信息之外的其他个人信息（您的实名认证信息是您通过实名认证时使用的姓名和身份证信息），如您需要变更您的实名认证信息，您可拨打95118服务热线申请变更。
六、Cookie 及网络 Beacon的使用

1、Cookie的使用
Cookie是由网页服务器存放在您的访问设备上的文本文件。指定给您的Cookie 是唯一的，它只能被将Cookie发布给您的域中的Web服务器读取。
前端使用 Cookie 来帮助您实现您的联机体验的个性化，使您在前端及其关联方获得更轻松的访问体验。例如，Cookie 会帮助您在后续访问前端网站时调用您的信息，简化记录您填写个人信息（例如一键登录等）的流程；为您提供安全购物的偏好设置；帮助您优化对广告的选择与互动；保护您的数据安全等。
您有权接受或拒绝 Cookie。大多数浏览器会自动接受Cookie，但您通常可根据自己的需要来修改浏览器的设置以拒绝 Cookie。如果选择拒绝 Cookie，那么您可能无法完全体验所访问的前端网站或某些服务的全部功能。
2、网络Beacon的使用
前端网页上常会包含一些电子图象（称为"单像素" GIF 文件或 "网络 beacon"），它们可以帮助网站计算浏览网页的用户或访问某些cookie。前端使用网络beacon的方式有：
（1）前端通过在前端网站上使用网络beacon，计算用户访问数量，并通过访问 cookie 辨认注册用户。
（2）前端通过得到的cookie信息，可以在前端网站提供个性化服务。

七、未成年人的个人信息保护

前端非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用前端服务前，应事先取得您家长或法定监护人的书面同意。前端根据国家相关法律法规的规定保护未成年人的个人信息。

八、通知和修订

为给你提供更好的服务，前端的业务将不时变化，本隐私政策也将随之调整。前端会通过在前端网站、移动端上发出更新版本并提醒您相关内容的更新，也请您访问前端以便及时了解最新的隐私政策。如果您对于本隐私政策或在使用前端服务时对于您的个人信息或隐私情况有任何问题，请联系前端客服并作充分描述，前端将尽力解决。
                </div>      
                <div class="privacy-bottom">
                    <div class="left" @click="call">
                        暂时不用
                    </div>
                    <div class="right" @click="checks">
                        使用
                    </div>
                </div>
            </div>
        </div>
</template>

<script>
export default {
    name:"privacy",
    created(){
        
    },
    methods:{
        call(){            
            this.$bus.$emit("privacy",false)
        },
        checks(){
            this.$bus.$emit("checks","")
            this.$bus.$emit("privacy",false)
        }
    }
}
</script>

<style lang="less">
.privacy{
    width: 100%;
    height: 100%;
    background: rgba(156, 156, 156, 0.3);
    position: absolute;
    z-index: 999;
    .privacy-content{
        position: relative;
        left:15%;
        right: 15%;
        height: 50%;
        top: 20%;
        background-color: rgb(255, 255, 255);
        width: 70%;
        border-radius: .266667rem .266667rem;
        .privacy-top{
            width: 100%;
            height: 10%;
            padding-top: 4%;
            padding-bottom: 10%;
            font-size: .4rem;
            text-align: center;
            border-bottom: .026667rem solid rgb(219, 218, 218);
        }
        .content{
            overflow: scroll;
            width: 100%;
            height:76%;
            vertical-align:middle;
            padding: 5%;
        }
        .privacy-bottom{
            width: 100%;
            height: 12%;
            border-top: .026667rem solid rgb(219, 218, 218);
            position: absolute;
            bottom: 0; 
            display: flex;
            flex-direction:row;
            font-size: .426667rem;
            .left{
                width: 50%;
                text-align: center;
                line-height: 1.066667rem;
                border-right: .026667rem solid rgb(218, 218, 218);
            }
            .right{
                width: 50%;
                text-align: center;
                line-height: 1.066667rem;
            }    
        }
    }
}
</style>